solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/da7212/fsl_dialog7212.h
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_DIALOG7212_H_
#define _FSL_DIALOG7212_H_

#include "fsl_codec_i2c.h"

/*!
 * @addtogroup da7212
 * @ingroup codec
 * @{
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @name Driver version */
/*! @{ */
/*! @brief CLOCK driver version 2.3.0. */
#define FSL_DA7212_DRIVER_VERSION (MAKE_VERSION(2, 3, 1))
/*! @} */

/*! @brief da7212 handle size */
#ifndef DA7212_I2C_HANDLER_SIZE
#define DA7212_I2C_HANDLER_SIZE CODEC_I2C_MASTER_HANDLER_SIZE
#endif

#define DA7212_INIT_SIZE   (36U)
#define DA7212_DAC_MAX_VOL (DA7213_DAC_GAIN_12DB)
#define DA7212_DAC_MIN_VOL (DA7212_DAC_GAIN_MUTE)

/*! @brief DA7212 I2C address */
#define DA7212_ADDRESS (0x1A)

#define DA7212_AUX_REGISTER_SIZE  (33)
#define DA7212_MIC2_REGISTER_SIZE (33)
#define DA7212_MIC1_REGISTER_SIZE (24)

#define DA7212_DAC_MUTE_ENABLED  (0xC0)
#define DA7212_DAC_MUTE_DISABLED (0x80)

#define DA7212_MAX_VOLUME_STEPS (15)
#define DA7212_MIN_VOLUME_STEPS (0)

#define DA7212_MAX_VOLUME_STEPS (15)

#define DA7212_CHANGE_FREQ_SIZE (0x05)

#define CLEAR_REGISTER (0x00)

#define DA7212_I2C_BAUDRATE (100000U)
/***************************************************************************************************/
/* * Register values. */

/******************Status registers*********************/
#define DIALOG7212_STATUS1             0x02
#define DIALOG7212_PLL_STATUS          0x03
#define DIALOG7212_AUX_L_GAIN_STATUS   0x04
#define DIALOG7212_AUX_R_GAIN_STATUS   0x05
#define DIALOG7212_MIC_1_GAIN_STATUS   0x06
#define DIALOG7212_MIC_2_GAIN_STATUS   0x07
#define DIALOG7212_MIXIN_L_GAIN_STATUS 0x08
#define DIALOG7212_MIXIN_R_GAIN_STATUS 0x09
#define DIALOG7212_ADC_L_GAIN_STATUS   0x0A
#define DIALOG7212_ADC_R_GAIN_STATUS   0x0B
#define DIALOG7212_DAC_L_GAIN_STATUS   0x0C
#define DIALOG7212_DAC_R_GAIN_STATUS   0x0D
#define DIALOG7212_HP_L_GAIN_STATUS    0x0E
#define DIALOG7212_HP_R_GAIN_STATUS    0x0F
#define DIALOG7212_LINE_GAIN_STATUS    0x10
/***************System Initialisation Registers************/
#define DIALOG7212_CIF_CTRL        0x1d
#define DIALOG7212_DIG_ROUTING_DAI 0x21
#define DIALOG7212_SR              0x22
#define DIALOG7212_REFERENCES      0x23
#define DIALOG7212_PLL_FRAC_TOP    0x24
#define DIALOG7212_PLL_FRAC_BOT    0x25
#define DIALOG7212_PLL_INTEGER     0x26
#define DIALOG7212_PLL_CTRL        0x27
#define DIALOG7212_DAI_CLK_MODE    0x28
#define DIALOG7212_DAI_CTRL        0x29
#define DIALOG7212_DIG_ROUTING_DAC 0x2A
#define DIALOG7212_ALC_CTRL1       0x2B
/************Input Gain/ Select Filter Registers**********/
#define DIALOG7212_AUX_L_GAIN     0x30
#define DIALOG7212_AUX_R_GAIN     0x31
#define DIALOG7212_MIXIN_L_SELECT 0x32
#define DIALOG7212_MIXIN_R_SELECT 0x33
#define DIALOG7212_MIXIN_L_GAIN   0x34
#define DIALOG7212_MIXIN_R_GAIN   0x35
#define DIALOG7212_ADC_L_GAIN     0x36
#define DIALOG7212_ADC_R_GAIN     0x37
#define DIALOG7212_ADC_FILTERS1   0x38
#define DIALOG7212_MIC_1_GAIN     0x39
#define DIALOG7212_MIC_2_GAIN     0x3A
/************Output Gain/ Select Filter Registers**********/
#define DIALOG7212_DAC_FILTERS5    0x40
#define DIALOG7212_DAC_FILTERS2    0x41
#define DIALOG7212_DAC_FILTERS3    0x42
#define DIALOG7212_DAC_FILTERS4    0x43
#define DIALOG7212_DAC_FILTERS1    0x44
#define DIALOG7212_DAC_L_GAIN      0x45
#define DIALOG7212_DAC_R_GAIN      0x46
#define DIALOG7212_CP_CTRL         0x47
#define DIALOG7212_HP_L_GAIN       0x48
#define DIALOG7212_HP_R_GAIN       0x49
#define DIALOG7212_LINE_GAIN       0x4A
#define DIALOG7212_MIXOUT_L_SELECT 0x4B
#define DIALOG7212_MIXOUT_R_SELECT 0x4C
/**************System Controller Registers(1)*************/
#define DIALOG7212_SYSTEM_MODES_INPUT  0x50
#define DIALOG7212_SYSTEM_MODES_OUTPUT 0x51
/*****************Control Registers(2)********************/
#define DIALOG7212_AUX_L_CTRL    0x60
#define DIALOG7212_AUX_R_CTRL    0x61
#define DIALOG7212_MICBIAS_CTRL  0x62
#define DIALOG7212_MIC_1_CTRL    0x63
#define DIALOG7212_MIC_2_CTRL    0x64
#define DIALOG7212_MIXIN_L_CTRL  0x65
#define DIALOG7212_MIXIN_R_CTRL  0x66
#define DIALOG7212_ADC_L_CTRL    0x67
#define DIALOG7212_ADC_R_CTRL    0x68
#define DIALOG7212_DAC_L_CTRL    0x69
#define DIALOG7212_DAC_R_CTRL    0x6A
#define DIALOG7212_HP_L_CTRL     0x6B
#define DIALOG7212_HP_R_CTRL     0x6C
#define DIALOG7212_LINE_CTRL     0x6D
#define DIALOG7212_MIXOUT_L_CTRL 0x6E
#define DIALOG7212_MIXOUT_R_CTRL 0x6F
/************ Registers**********/

/****************Configuration Registers*****************/
#define DIALOG7212_LDO_CTRL            0x90
#define DIALOG7212_GAIN_RAMP_CTRL      0x92
#define DIALOG7212_MIC_CONFIG          0x93
#define DIALOG7212_PC_COUNT            0x94
#define DIALOG7212_CP_VOL_THRESHOLD1   0x95
#define DIALOG7212_CP_DELAY            0x96
#define DIALOG7212_CP_DETECTOR         0x97
#define DIALOG7212_DAI_OFFSET          0x98
#define DIALOG7212_DIG_CTRL            0x99
#define DIALOG7212_ALC_CTRL2           0x9A
#define DIALOG7212_ALC_CTRL3           0x9B
#define DIALOG7212_ALC_NOISE           0x9C
#define DIALOG7212_ALC_TARGET_MIN      0x9D
#define DIALOG7212_ALC_TARGET_MAX      0x9E
#define DIALOG7212_ALC_GAIN_LIMITS     0x9F
#define DIALOG7212_ALC_ANA_GAIN_LIMITS 0xA0
#define DIALOG7212_ALC_ANTICLIP_CTRL   0xA1
#define DIALOG7212_ALC_ANTICLIP_LEVEL  0xA2
#define DIALOG7212_DAC_NG_SETUP_TIME   0xAF
#define DIALOG7212_DAC_NG_OFF_THRESH   0xB0
#define DIALOG7212_DAC_NG_ON_THRESH    0xB1
#define DIALOG7212_DAC_NG_CTRL         0xB2
// #define DIALOG7212_DAC_NG_SPARE                       0xB3
/************Tone Generation & Beep Registers************/
#define DIALOG7212_TONE_GEN_CFG1    0xB4
#define DIALOG7212_TONE_GEN_CFG2    0xB5
#define DIALOG7212_TONE_GEN_CYCLES  0xB6
#define DIALOG7212_TONE_GEN_FREQ1_L 0xB7
#define DIALOG7212_TONE_GEN_FREQ1_U 0xB8
#define DIALOG7212_TONE_GEN_FREQ2_L 0xB9
#define DIALOG7212_TONE_GEN_FREQ2_U 0xBA
#define DIALOG7212_TONE_GEN_ON_PER  0xBB
#define DIALOG7212_TONE_GEN_OFF_PER 0xBC

/************System Controller Registers(2)*************/
#define DIALOG7212_SYSTEM_STATUS 0xE0

#define DIALOG7212_SYSTEM_ACTIVE 0xFD

/******************Driver DA7212 Macros*****************/

/******************Status registers*********************/
/* DIALOG7212_PLL_STATUS                         0x03*/
#define DIALOG7212_PLL_STATUS_BYPASS_ACTIVE_MASK (1U << 3)
#define DIALOG7212_PLL_STATUS_MCLK_STATUS_MASK   (1U << 2)
#define DIALOG7212_PLL_STATUS_SRM_LOCK_MASK      (1U << 1)
#define DIALOG7212_PLL_STATUS_LOCK_MASK          (1U << 0)

/* DIALOG7212_AUX_L_GAIN_STATUS                  0x04*/
#define DIALOG7212_AUX_L_AMP_GAIN_STATUS_MASK  (0x3F)
#define DIALOG7212_AUX_L_AMP_GAIN_STATUS_SHIFT (0U)
#define DIALOG7212_AUX_L_AMP_GAIN_STATUS(x)    ((x) << DIALOG7212_AUX_L_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_AUX_R_GAIN_STATUS                  0x05*/
#define DIALOG7212_AUX_R_AMP_GAIN_STATUS_MASK  (0x3F)
#define DIALOG7212_AUX_R_AMP_GAIN_STATUS_SHIFT (0U)
#define DIALOG7212_AUX_R_AMP_GAIN_STATUS(x)    ((x) << DIALOG7212_AUX_R_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_MIC_1_GAIN_STATUS                  0x06*/
#define DIALOG7212_MIC_1_AMP_GAIN_STATUS_MASK  (0x07)
#define DIALOG7212_MIC_1_AMP_GAIN_STATUS_SHIFT (0U)
#define DIALOG7212_MIC_1_AMP_GAIN_STATUS(x)    ((x) << DIALOG7212_MIC_1_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_MIC_2_GAIN_STATUS                  0x07*/
#define DIALOG7212_MIC_2_AMP_GAIN_STATUS_MASK  (0x07)
#define DIALOG7212_MIC_2_AMP_GAIN_STATUS_SHIFT (0U)
#define DIALOG7212_MIC_2_AMP_GAIN_STATUS(x)    ((x) << DIALOG7212_MIC_2_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_MIXIN_L_GAIN_STATUS                0x08*/
#define DIALOG7212_MIXIN_L_AMP_GAIN_STATUS_MASK  (0x0F)
#define DIALOG7212_MIXIN_L_AMP_GAIN_STATUS_SHIFT (0U)
#define DIALOG7212_MIXIN_L_AMP_GAIN_STATUS(x)    ((x) << DIALOG7212_MIXIN_L_AMP_GAIN_STATUS_SHIFT)

