solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/da7212/fsl_dialog7212.h
/*! @brief da7212 pll configuration */
typedef struct _da7212_pll_config
{
    da7212_pll_clk_source_t source;      /*!< pll reference clock source */
    uint32_t refClock_HZ;                /*!< pll reference clock frequency */
    da7212_pll_out_clk_t outputClock_HZ; /*!< pll output clock frequency  */
} da7212_pll_config_t;

/*! @brief da7212 audio format */
typedef struct _da7212_audio_format
{
    uint32_t mclk_HZ;    /*!< master clock frequency */
    uint32_t sampleRate; /*!< sample rate */
    uint32_t bitWidth;   /*!< bit width */
    bool isBclkInvert;   /*!< bit clock intervet */
} da7212_audio_format_t;

/*! @brief DA7212 configure structure */
typedef struct da7212_config
{
    bool isMaster;                        /*!< If DA7212 is master, true means master, false means slave. */
    da7212_protocol_t protocol;           /*!< Audio bus format, can be I2S, LJ, RJ or DSP mode. */
    da7212_dac_source_t dacSource;        /*!< DA7212 data source. */
    da7212_audio_format_t format;         /*!< audio format */
    uint8_t slaveAddress;                 /*!< device address */
    codec_i2c_config_t i2cConfig;         /*!< i2c configuration */

    da7212_sys_clk_source_t sysClkSource; /*!< system clock source */
    da7212_pll_config_t *pll;             /*!< pll configuration */
    da7212_Input_t inputSource;           /*!< AD212 input source*/
} da7212_config_t;

/*! @brief da7212 codec handler
 */
typedef struct _da7212_handle
{
    da7212_config_t *config;                    /*!< da7212 config pointer */
    uint8_t i2cHandle[DA7212_I2C_HANDLER_SIZE]; /*!< i2c handle */
} da7212_handle_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief DA7212 initialize function.
 *
 * @param handle DA7212 handle pointer.
 * @param codecConfig Codec configure structure. This parameter can be NULL, if NULL, set as default settings.
 * The default setting:
 * @code
 * sgtl_init_t codec_config
 * codec_config.route = kDA7212_RoutePlayback
 * codec_config.bus = kDA7212_BusI2S
 * codec_config.isMaster = false
 * @endcode
 */
status_t DA7212_Init(da7212_handle_t *handle, da7212_config_t *codecConfig);

/*!
 * @brief Set DA7212 audio format.
 *
 * @param handle DA7212 handle pointer.
 * @param masterClock_Hz Master clock frequency in Hz. If DA7212 is slave, use the frequency of master, if DA7212 as
 * master, it should be 1228000 while sample rate frequency is 8k/12K/16K/24K/32K/48K/96K, 11289600 whie sample rate is
 * 11.025K/22.05K/44.1K
 * @param sampleRate_Hz Sample rate frequency in Hz.
 * @param dataBits How many bits in a word of a audio frame, DA7212 only supports 16/20/24/32 bits.
 */
status_t DA7212_ConfigAudioFormat(da7212_handle_t *handle,
                                  uint32_t masterClock_Hz,
                                  uint32_t sampleRate_Hz,
                                  uint32_t dataBits);

/*!
 * @brief DA7212 set PLL configuration
 * This function will enable the GPIO1 FLL clock output function, so user can see
 * the generated fll output clock frequency from WM8904 GPIO1.
 *
 * @param handle DA7212 handler pointer.
 * @param config PLL configuration pointer.
 *
 */
status_t DA7212_SetPLLConfig(da7212_handle_t *handle, da7212_pll_config_t *config);

/*!
 * @brief Set DA7212 playback volume.
 *
 * @param handle DA7212 handle pointer.
 * @param volume The volume of playback.
 */
void DA7212_ChangeHPVolume(da7212_handle_t *handle, da7212_volume_t volume);

/*!
 * @brief Mute or unmute DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param isMuted True means mute, false means unmute.
 */
void DA7212_Mute(da7212_handle_t *handle, bool isMuted);

/*!
 * @brief Set the input data source of DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param DA7212_Input Input data source.
 */
void DA7212_ChangeInput(da7212_handle_t *handle, da7212_Input_t DA7212_Input);

/*!
 * @brief Set the output device of DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param DA7212_Output Output device of DA7212.
 */
void DA7212_ChangeOutput(da7212_handle_t *handle, da7212_Output_t DA7212_Output);

/*!
 * @brief Set module volume.
 *
 * @param handle DA7212 handle pointer.
 * @param channel shoule be a value of _da7212_channel.
 * @param volume volume range 0 - 0x3F mapped to range -57dB - 6dB.
 */
status_t DA7212_SetChannelVolume(da7212_handle_t *handle, uint32_t channel, uint32_t volume);

/*!
 * @brief Set module mute.
 *
 * @param handle DA7212 handle pointer.
 * @param channel shoule be a value of _da7212_channel.
 * @param isMute true is mute, false is unmute.
 */
status_t DA7212_SetChannelMute(da7212_handle_t *handle, uint32_t channel, bool isMute);

/*!
 * @brief Set protocol for DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param protocol da7212_protocol_t.
 */
status_t DA7212_SetProtocol(da7212_handle_t *handle, da7212_protocol_t protocol);

/*!
 * @brief Set master mode bits per frame for DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param bitWidth audio data bitwidth.
 */
status_t DA7212_SetMasterModeBits(da7212_handle_t *handle, uint32_t bitWidth);

/*!
 * @brief Write a register for DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param u8Register DA7212 register address to be written.
 * @param u8RegisterData Data to be written into regsiter
 */
status_t DA7212_WriteRegister(da7212_handle_t *handle, uint8_t u8Register, uint8_t u8RegisterData);

/*!
 * @brief Get a register value of DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param u8Register DA7212 register address to be read.
 * @param pu8RegisterData Pointer where the read out value to be stored.
 */
status_t DA7212_ReadRegister(da7212_handle_t *handle, uint8_t u8Register, uint8_t *pu8RegisterData);

/*!
 * @brief Deinit DA7212.
 *
 * @param handle DA7212 handle pointer.
 */
status_t DA7212_Deinit(da7212_handle_t *handle);

#if defined(__cplusplus)
}
#endif

/*! @} */
#endif /* _FSL_DIALOG7212_H_ */
